package org.engine.utils;

import java.util.ArrayList;
import java.util.List;

public class SearchTypes {

    private List<String> list = new ArrayList<String>();

    public void init(){
        list.add("Преки инвестиции на местни лица в дялов капитал в чужбина");
        list.add("Преки инвестиции на чуждестранни лица в дялов капитал в България");
        list.add("Инвестиции на местни лица в недвижими имоти в чужбина");
        list.add("Инвестиции на чуждестранни лица в недвижими имоти в България");
        list.add("Портфейлни инвестиции на местни лица в ценни книжа емитирани от чуждестранни лица");
        list.add("Портфейлни инвестиции на чуждестранни лица в ценни книжа емитирани от местни лица");
        list.add("Инвестиции на местни лица в акции емитирани от чуждестранни лица");
        list.add("Инвестиции на чуждестранни лица в акции емитирани от местни лица");
        list.add("Покупко-продажба на финансови деривати различни от опции");
        list.add("Краткосрочни кредити предоставени от местни на чужди лица");
        list.add("Краткосрочни кредити предоставени от чуждестранни на местни лица");
        list.add("Репо операции, активи");
        list.add("Репо операции, пасиви");
        list.add("Депозитни, разплащателни и други сметки на местни лица, клиенти на банката, при чуждестранни лица");
        list.add("Депозитни, разплащателни и други сметки на чуждестранни лица небанки при местни банки");
    }
}
